src/test/java/performance/EarlyAccessPerformanceTest.yml
---
execution:
- concurrency: 10
  ramp-up: 1m
  hold-for: 1m30s
  scenario: basic-performance-test

scenarios:
  basic-performance-test:
    think-time: 0.75
    requests:
    - http://cluboservice-cluboautomation.test.overstock.com:20620/clubo/v1/info/127524034/newsletter?x-api-key=x-api-key&auth-context=a&rewardsPageSize=10