src/test/java/performance/EarlyAccessPerformanceTest.yml
---
execution:
- concurrency: 10
  ramp-up: 1m
  hold-for: 1m30s
  scenario: basic-performance-test

scenarios:
  basic-performance-test:
    think-time: 0.75
    requests:
    - http://earlyaccess.cluboautomation.test.ostk.com:8080/early/access/product/9809209
    - http://earlyaccess.cluboautomation.test.ostk.com:8080/early/access/product/0
    - url: http://earlyaccess.cluboautomation.test.ostk.com:8080/early/access/product/batch/status
      body:
        productIds: [2332,6688,1769,2841,6832,6526,9844,3105,2942,3750,7135,5911,8768,742,7612,4384,6794,9048,5437]
      method: POST